In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/harissriramoju/DataScience-Samples/master/scientists.csv")

In [3]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [4]:
df.shape

(8, 5)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:

df.Born.shape

(8,)

In [8]:
type(df.Born)

pandas.core.series.Series

In [9]:
df.Born.dtype

dtype('O')

In [10]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [11]:
df["Born_datetime"]=pd.to_datetime(df["Born"],format="%Y-%m-%d")

In [12]:
df

,Name,Born,Died,Age,Occupation,Born_datetime
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   Born           8 non-null      object
 2   Died           8 non-null      object
 3   Age            8 non-null      int64
 4   Occupation     8 non-null      object
 5   Born_datetime  8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 512.0+ bytes

In [14]:
df["Died_datetime"]=pd.to_datetime(df["Died"],format="%Y-%m-%d")

In [15]:
df

,Name,Born,Died,Age,Occupation,Born_datetime,Died_datetime
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   Born           8 non-null      object
 2   Died           8 non-null      object
 3   Age            8 non-null      int64
 4   Occupation     8 non-null      object
 5   Born_datetime  8 non-null      datetime64[ns]
 6   Died_datetime  8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [17]:
df.dtypes

Name                     object
Born                     object
Died                     object
Age                       int64
Occupation               object
Born_datetime    datetime64[ns]
Died_datetime    datetime64[ns]
dtype: object

In [18]:
df["days_diff"]=df["Died_datetime"]-df["Born_datetime"]

In [19]:
df

,Name,Born,Died,Age,Occupation,Born_datetime,Died_datetime,days_diff
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [20]:
df.drop("Born",axis=1,inplace=True)

In [21]:
df

,Name,Died,Age,Occupation,Born_datetime,Died_datetime,days_diff
0,Rosaline Franklin,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [22]:
df.drop("Died",axis=1,inplace=True)

In [23]:
df

,Name,Age,Occupation,Born_datetime,Died_datetime,days_diff
0,Rosaline Franklin,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,77,Mathematician,1777-04-30,1855-02-23,28422 days

>>>><h1><font color="meganta">Tips Dataset</font></h1>

In [24]:
#!pip install seaborn
import seaborn as sns

In [25]:
df=sns.load_dataset("tips")

In [26]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

<h1><font color="green">Answer the following questionst</font></h1>

#  1. How many males and females are there?

In [27]:
df["sex"].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

# 2. The one how paying the more total_bill,is males or female?

In [29]:
df["total_bill"].max()

50.81

In [30]:
df.query("total_bill == total_bill.max()")["sex"]

170    Male
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

# 3. On which day more customers are comming?

In [ ]:
df["day"].value_counts()

# 4. Who paying the more tip on sunday?( means male or female?)

In [ ]:
df[df["day"]=="Sun"].nlargest(1,"tip")["sex"]

In [ ]:
df[df["day"]=="Sun"].query("tip==tip.max()")["sex"]

In [ ]:
df.query("day=='Sun'").query("tip==tip.max()")["sex"]

In [ ]:
print("this is 'python' programming")

# 5. Find the average total bill of male and female based on smoker attribute?

In [ ]:

df.groupby(['sex','smoker'])["total_bill"].mean()

In [ ]:
df["sex"]

In [ ]:
df[df["sex"]=="Male"]

In [ ]:
df.loc[121,"tip"] ##colum name

In [ ]:
df.iloc[121,1]  ##column numb

In [ ]:
df.iloc[10:30:3,]

In [ ]:
#157
df.iloc[[1,5,7],]

In [ ]:
len(df)

# Q6. what is the percentage of smokers in the given dataset

In [ ]:
len(df[df["smoker"]=="Yes"].value_counts())*100/len(df)

In [ ]:
len(df[df["smoker"]=="Yes"].value_counts())

In [ ]:
len(df[df["smoker"]=="Yes"])

In [ ]:
df["smoker"].value_counts()

In [ ]:
len(df[df["smoker"]=="Yes"])*100/len(df)


# Q7 which gender has the most occupied space when the table size is 3

In [ ]:
df[df["size"]==3]["sex"].value_counts()

In [ ]:
sns.countplot(data=df,x="sex")

In [ ]:
dff=df[df["size"]==3]
sns.countplot(data=dff,x="sex")

# Q8 what is the different amout of data percentage with respect to gender ?How much higher is comparind to opposite gender

In [ ]:
print(len(df[df["sex"]=="Male"])*100/len(df))
print(len(df[df["sex"]=="Female"])*100/len(df))

In [ ]:
(len(df[df["sex"]=="Male"])-len(df[df["sex"]=="Female"]))*100/len(df)

# Q9 which gender has offered most valauble tips when the total bill value is btw 10 to 20 dollors

In [ ]:
df

In [ ]:
df.query("10 > total_bill < 20").nlargest(1,"tip")["sex"]

# Q10 which time of restaurants  visit is mostly preffered by customers

In [ ]:
sns.countplot(data=df,x="time")

In [ ]:
df.groupby("sex")["tip"].mean()

In [ ]:
sns.countplot(data=df,x="size",hue="sex")

# Q16) do you think friday has recieved highest sales when comparing to other days

In [ ]:
sns.countplot(data=df,x="day")

# Q17) btw table sizes 2 and 4 which one has prefered very offen

In [ ]:
df

In [ ]:
dff=df[df["size"]==2]["size"]==4

In [ ]:
len(df[df["size"]==2])

In [ ]:
len(df[df["size"]==4])

In [ ]:
df1=df[((df["size"]==2)|(df["size"]==4))]
df1

In [ ]:
df[((df["size"]==2)|(df["size"]==4))]["size"].value_counts()

# Q 18) thursday has a great yes or no ? justify your answer.

In [ ]:
sns.countplot(data=df,x="day")

# Q19 ) what is highest bill paid by the female

In [ ]:
df[df["sex"]=='Female'].nlargest(1,"total_bill")

# Q 20) what is different btw the highest bill paid by the male and female

In [ ]:
df.groupby('sex')['total_bill'].max()

In [ ]:
sns.displot(data=df,x='total_bill',hue='sex')

 # Q21) In bollywood dataset, what type of relationship having between the budget and the box office collection

In [ ]:
df2=pd.read_csv("bollywood.csv")

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
sns.regplot(data=df2,x="Budget",y="BoxOfficeCollection")

In [ ]:
plt.scatter(data['Budget'],data['BoxOfficeCollection'])

 # Q22) expalin the distribution of the budget

In [ ]:
sns.displot(df2['Budget'],kde="True")

# Q23) Is there any outliers in youtube likes when it is a comady movie

In [ ]:
df2[df2["Genre"]=='Comedy']

In [ ]:
sns.boxplot(data=df2[df2["Genre"]=='Comedy'],y="YoutubeLikes")

# Q24 ) do the univariate and bivariate and multivariate analysis of the tips dataset

In [ ]:
data

In [ ]:
sns.countplot(data=data,x='Genre')

In [ ]:
sns.countplot(data=data,x='Genre',hue='ReleaseTime')

In [ ]:
sns.countplot(data=data,x='Genre',hue='ReleaseTime')

In [ ]:
data

In [ ]:
sns.displot(data=data,x="Budget",col="Genre")

In [ ]:
sns.displot(data=data,x="Budget")

In [ ]:
sns.regplot(data=data,x="Budget",y="YoutubeViews")

In [ ]:
df=pd.read_csv("Automobile_data.csv")

In [ ]:
pip install missingno

In [ ]:
import missingno as mn

In [ ]:
df.isnull().sum()

In [ ]:
df

In [ ]:
mn.bar(df,figsize=(10,8),color="yellowgreen")